In [24]:
import pandas as pd
import numpy as np

In [4]:
people["email"]

['coreyschafer@gmail.com', 'janedoe@gmail.com', 'johndoe@gamil.com']

In [25]:
people={
       "first":["corey","jane","john","Adam",np.nan,None,"na"],
       "last":["schafer","Doe","Doe","Doe", np.nan,np.nan, "missing"],
       "email":["coreyschafer@gmail.com","janedoe@gmail.com","johndoe@gamil.com","A@gmail.com",None ,np.nan,"missing"],
       "age": ["33","55","63","36",None,None ,"missing"]
       }

In [44]:
df=pd.DataFrame(people)


df.replace("na",np.nan,inplace=True)
df.replace("missing",np.nan,inplace=True)

In [45]:
df

   first     last                   email   age
0  corey  schafer  coreyschafer@gmail.com    33
1   jane      Doe       janedoe@gmail.com    55
2   john      Doe       johndoe@gamil.com    63
3   Adam      Doe             A@gmail.com    36
4    NaN      NaN                    None  None
5   None      NaN                     NaN  None
6    NaN      NaN                     NaN   NaN

In [9]:
df["email"]

0    coreyschafer@gmail.com
1         janedoe@gmail.com
2         johndoe@gamil.com
Name: email, dtype: object

In [10]:
type(df["email"])

pandas.core.series.Series

In [11]:
type(df)

pandas.core.frame.DataFrame

In [13]:
df[["email","last"]]

                    email     last
0  coreyschafer@gmail.com  schafer
1       janedoe@gmail.com      Doe
2       johndoe@gamil.com      Doe

In [14]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [19]:
df.iloc[[0,1],2]

0    coreyschafer@gmail.com
1         janedoe@gmail.com
Name: email, dtype: object

In [20]:
df

   first     last                   email
0  corey  schafer  coreyschafer@gmail.com
1   jane      Doe       janedoe@gmail.com
2   john      Doe       johndoe@gamil.com

In [21]:
df.loc[0]

first                     corey
last                    schafer
email    coreyschafer@gmail.com
Name: 0, dtype: object

In [22]:
df.loc[[0,1]]

   first     last                   email
0  corey  schafer  coreyschafer@gmail.com
1   jane      Doe       janedoe@gmail.com

In [23]:
df.loc[[0,1],["email","last"]]

                    email     last
0  coreyschafer@gmail.com  schafer
1       janedoe@gmail.com      Doe

In [24]:
df

   first     last                   email
0  corey  schafer  coreyschafer@gmail.com
1   jane      Doe       janedoe@gmail.com
2   john      Doe       johndoe@gamil.com

In [27]:
df.set_index("email",inplace=True)

In [28]:
df

                        first     last
email
coreyschafer@gmail.com  corey  schafer
janedoe@gmail.com        jane      Doe
johndoe@gamil.com        john      Doe

In [29]:
df.index

Index(['coreyschafer@gmail.com', 'janedoe@gmail.com', 'johndoe@gamil.com'], dtype='object', name='email')

In [30]:
df.loc["coreyschafer@gmail.com"]

first      corey
last     schafer
Name: coreyschafer@gmail.com, dtype: object

In [36]:
df.iloc[0]

first      corey
last     schafer
Name: coreyschafer@gmail.com, dtype: object

In [37]:
df.reset_index(inplace=True)
df

                    email  first     last
0  coreyschafer@gmail.com  corey  schafer
1       janedoe@gmail.com   jane      Doe
2       johndoe@gamil.com   john      Doe

In [29]:
filt= (df["last"]=="schafer") | (df["first"]=="john")

In [25]:
df[~filt]

  first last              email
1  jane  Doe  janedoe@gmail.com

In [16]:
df[df["last"]=="Doe"]

  first last              email
1  jane  Doe  janedoe@gmail.com
2  john  Doe  johndoe@gamil.com

In [30]:
df.loc[filt,"email"]

0    coreyschafer@gmail.com
2         johndoe@gamil.com
Name: email, dtype: object

In [31]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [32]:
df.columns=['first_name', 'last_name', 'email']

In [33]:
df

  first_name last_name                   email
0      corey   schafer  coreyschafer@gmail.com
1       jane       Doe       janedoe@gmail.com
2       john       Doe       johndoe@gamil.com

In [34]:
df.columns =[x.upper()for x in df.columns]

In [35]:
df

  FIRST_NAME LAST_NAME                   EMAIL
0      corey   schafer  coreyschafer@gmail.com
1       jane       Doe       janedoe@gmail.com
2       john       Doe       johndoe@gamil.com

In [43]:
df.columns =df.columns.str.replace(" ","_")

In [44]:
df

  first_name last_name                   email
0      corey   schafer  coreyschafer@gmail.com
1       jane       Doe       janedoe@gmail.com
2       john       Doe       johndoe@gamil.com

In [38]:
df.columns =[x.lower()for x in df.columns]

In [39]:
df

  first name last name                   email
0      corey   schafer  coreyschafer@gmail.com
1       jane       Doe       janedoe@gmail.com
2       john       Doe       johndoe@gamil.com

In [47]:
df.rename(columns={"first_name":"first","last_name":"last"},inplace= True)

In [48]:
df

   first     last                   email
0  corey  schafer  coreyschafer@gmail.com
1   jane      Doe       janedoe@gmail.com
2   john      Doe       johndoe@gamil.com

In [51]:
df.loc[2] =["john","smith", "johnsmith@gmail.com"]

In [52]:
df

   first     last                   email
0  corey  schafer  coreyschafer@gmail.com
1   jane      Doe       janedoe@gmail.com
2   john    smith     johnsmith@gmail.com

In [54]:
df.loc[2,["last","email"]]=["Doe","johndoe@gamil.com"]

In [55]:
df

   first     last                   email
0  corey  schafer  coreyschafer@gmail.com
1   jane      Doe       janedoe@gmail.com
2   john      Doe       johndoe@gamil.com

In [56]:
df.loc[2,"last"]="doe"

In [57]:
df.at[2,"last"]="Doe"

In [59]:
df

   first     last                   email
0  corey  schafer  coreyschafer@gmail.com
1   jane      Doe       janedoe@gmail.com
2   john      Doe       johndoe@gamil.com

In [60]:
filt=(df["email"]=="johndoe@gamil.com")

In [64]:
df[filt]["last"] ="smith"

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [65]:
df

   first     last                   email
0  corey  schafer  coreyschafer@gmail.com
1   jane      Doe       janedoe@gmail.com
2   john      Doe       johndoe@gamil.com

In [66]:
df.loc[filt,"last"] ="smith"

In [67]:
df

   first     last                   email
0  corey  schafer  coreyschafer@gmail.com
1   jane      Doe       janedoe@gmail.com
2   john    smith       johndoe@gamil.com

In [69]:
df["email"]=df["email"].str.lower()

In [70]:
df

   first     last                   email
0  corey  schafer  coreyschafer@gmail.com
1   jane      Doe       janedoe@gmail.com
2   john    smith       johndoe@gamil.com

In [71]:
df["email"].apply(len)

0    22
1    17
2    17
Name: email, dtype: int64

In [72]:
def  update_email(email):
    return email.upper()

In [74]:
df["email"]=df["email"].apply(update_email)

In [75]:
df

   first     last                   email
0  corey  schafer  COREYSCHAFER@GMAIL.COM
1   jane      Doe       JANEDOE@GMAIL.COM
2   john    smith       JOHNDOE@GAMIL.COM

In [76]:
df["email"]=df["email"].apply(lambda x:x.lower())

In [77]:
df

   first     last                   email
0  corey  schafer  coreyschafer@gmail.com
1   jane      Doe       janedoe@gmail.com
2   john    smith       johndoe@gamil.com

In [78]:
df["email"].apply(len)

0    22
1    17
2    17
Name: email, dtype: int64

In [79]:
df.apply(len)

first    3
last     3
email    3
dtype: int64

In [80]:
len(df["email"])

3

In [82]:
df.apply(pd.Series.min)

first                     corey
last                        Doe
email    coreyschafer@gmail.com
dtype: object

In [84]:
df.apply(lambda x:x.min())

first                     corey
last                        Doe
email    coreyschafer@gmail.com
dtype: object

In [85]:
df.applymap(len)

   first  last  email
0      5     7     22
1      4     3     17
2      4     5     17

In [86]:
df.applymap(str.lower)

   first     last                   email
0  corey  schafer  coreyschafer@gmail.com
1   jane      doe       janedoe@gmail.com
2   john    smith       johndoe@gamil.com

In [87]:
df["first"].map({"corey":"chris","jane":"mary"})

0    chris
1     mary
2      NaN
Name: first, dtype: object

In [89]:
df["first"]=df["first"].replace({"corey":"chris","jane":"mary"})

In [6]:
df

   first     last                   email
0  corey  schafer  coreyschafer@gmail.com
1   jane      Doe       janedoe@gmail.com
2   john      Doe       johndoe@gamil.com

In [7]:
df["first"] +" "+ df["last"]

0    corey schafer
1         jane Doe
2         john Doe
dtype: object

In [14]:
df["full_name"] =df["first"] +" "+ df["last"]

In [15]:
df

   first     last                   email      full_name
0  corey  schafer  coreyschafer@gmail.com  corey schafer
1   jane      Doe       janedoe@gmail.com       jane Doe
2   john      Doe       johndoe@gamil.com       john Doe

In [23]:
df.drop(columns=["first","last"],inplace=True)

In [24]:
df

                    email      full_name
0  coreyschafer@gmail.com  corey schafer
1       janedoe@gmail.com       jane Doe
2       johndoe@gamil.com       john Doe

In [17]:
df["full_name"].str.split()

0    [corey, schafer]
1         [jane, Doe]
2         [john, Doe]
Name: full_name, dtype: object

In [25]:
df[["first","last"]] = df["full_name"].str.split(' ', expand=True)

In [26]:
df

                    email      full_name  first     last
0  coreyschafer@gmail.com  corey schafer  corey  schafer
1       janedoe@gmail.com       jane Doe   jane      Doe
2       johndoe@gamil.com       john Doe   john      Doe

In [28]:
df.append({"first","tonny"},ignore_index=True)

TypeError: cannot concatenate object of type "<class 'set'>"; only pd.Series, pd.DataFrame, and pd.Panel (deprecated) objs are valid

In [33]:
df

   first     last                   email
0  corey  schafer  coreyschafer@gmail.com
1   jane      Doe       janedoe@gmail.com
2   john      Doe       johndoe@gamil.com

In [36]:
df.append({"first":"tonny"},ignore_index=True)

   first     last                   email
0  corey  schafer  coreyschafer@gmail.com
1   jane      Doe       janedoe@gmail.com
2   john      Doe       johndoe@gamil.com
3  tonny      NaN                     NaN

In [38]:
people={
       "first":["tony","steve"],
       "last":["stark","rogers"],
       "email":["ironmane@avengers.com","cap@avenge.com"]
       }

In [40]:
df2=pd.DataFrame(people)

In [45]:
df2

   first    last                  email
0   tony   stark  ironmane@avengers.com
1  steve  rogers         cap@avenge.com

In [46]:
df

   first     last                   email
0  corey  schafer  coreyschafer@gmail.com
1   jane      Doe       janedoe@gmail.com
2   john      Doe       johndoe@gamil.com

In [47]:
df.append(df2,ignore_index=True)

   first     last                   email
0  corey  schafer  coreyschafer@gmail.com
1   jane      Doe       janedoe@gmail.com
2   john      Doe       johndoe@gamil.com
3   tony    stark   ironmane@avengers.com
4  steve   rogers          cap@avenge.com

In [48]:
df=df.append(df2,ignore_index=True)

In [49]:
df

   first     last                   email
0  corey  schafer  coreyschafer@gmail.com
1   jane      Doe       janedoe@gmail.com
2   john      Doe       johndoe@gamil.com
3   tony    stark   ironmane@avengers.com
4  steve   rogers          cap@avenge.com

In [50]:
df.drop(index=4)

   first     last                   email
0  corey  schafer  coreyschafer@gmail.com
1   jane      Doe       janedoe@gmail.com
2   john      Doe       johndoe@gamil.com
3   tony    stark   ironmane@avengers.com

In [57]:
filt=df["last"]=="Doe"
df.drop(index=df[filt].index)

   first     last                   email
0  corey  schafer  coreyschafer@gmail.com
3   tony    stark   ironmane@avengers.com
4  steve   rogers          cap@avenge.com

In [58]:
df

   first     last                   email
0  corey  schafer  coreyschafer@gmail.com
1   jane      Doe       janedoe@gmail.com
2   john      Doe       johndoe@gamil.com
3   tony    stark   ironmane@avengers.com
4  steve   rogers          cap@avenge.com

In [61]:
df

   first     last                   email
0  corey  schafer  coreyschafer@gmail.com
1   jane      Doe       janedoe@gmail.com
2   john      Doe       johndoe@gamil.com

In [63]:
df.sort_values(by="last",ascending=False)

   first     last                   email
0  corey  schafer  coreyschafer@gmail.com
1   jane      Doe       janedoe@gmail.com
2   john      Doe       johndoe@gamil.com

In [68]:
df.sort_values(by=["last","first"],ascending=False)

   first     last                   email
0  corey  schafer  coreyschafer@gmail.com
2   john      Doe       johndoe@gamil.com
1   jane      Doe       janedoe@gmail.com
3   Adam      Doe             A@gmail.com

In [70]:
df.sort_values(by=["last","first"],ascending=[False,True],inplace=True)

In [71]:
df

   first     last                   email
0  corey  schafer  coreyschafer@gmail.com
3   Adam      Doe             A@gmail.com
1   jane      Doe       janedoe@gmail.com
2   john      Doe       johndoe@gamil.com

In [72]:
df.sort_index()

   first     last                   email
0  corey  schafer  coreyschafer@gmail.com
1   jane      Doe       janedoe@gmail.com
2   john      Doe       johndoe@gamil.com
3   Adam      Doe             A@gmail.com

In [73]:
df["last"].sort_values()

3        Doe
1        Doe
2        Doe
0    schafer
Name: last, dtype: object

In [36]:
df.dropna(axis="index",how="any",subset=["last","email"])

   first     last                   email      age
0  corey  schafer  coreyschafer@gmail.com       33
1   jane      Doe       janedoe@gmail.com       55
2   john      Doe       johndoe@gamil.com       63
3   Adam      Doe             A@gmail.com       36
6     na  missing                 missing  missing

In [42]:
df.dropna()

   first     last                   email age
0  corey  schafer  coreyschafer@gmail.com  33
1   jane      Doe       janedoe@gmail.com  55
2   john      Doe       johndoe@gamil.com  63
3   Adam      Doe             A@gmail.com  36

In [43]:
df.dropna(axis="index",how="any",subset=["last","email"])

   first     last                   email age
0  corey  schafer  coreyschafer@gmail.com  33
1   jane      Doe       janedoe@gmail.com  55
2   john      Doe       johndoe@gamil.com  63
3   Adam      Doe             A@gmail.com  36

In [47]:
df.isna()

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False  False  False
4   True   True   True   True
5   True   True   True   True
6   True   True   True   True

In [49]:
df.fillna(0)

   first     last                   email age
0  corey  schafer  coreyschafer@gmail.com  33
1   jane      Doe       janedoe@gmail.com  55
2   john      Doe       johndoe@gamil.com  63
3   Adam      Doe             A@gmail.com  36
4      0        0                       0   0
5      0        0                       0   0
6      0        0                       0   0

In [50]:
df.dtypes

first    object
last     object
email    object
age      object
dtype: object

In [51]:
df["age"].mean()

TypeError: must be str, not int

In [52]:
type(np.nan)

float

In [54]:
df["age"]=df["age"].astype(float)

In [56]:
df.dtypes

first     object
last      object
email     object
age      float64
dtype: object

In [57]:
df["age"].mean()

46.75